
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("СтруктураДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	ИсходнаяТаблица 	= Параметры.СтруктураДокумента.ТабЗнач;
	СсылкаНаДокумент 	= Параметры.СтруктураДокумента.Документ;
	ИмяТаблицы 			= Параметры.СтруктураДокумента.ИмяТабличнойЧасти;

	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаВыбора = Новый ОписаниеТипов(МассивТипаВыбора);
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ТаблицаРаспределения", ОписаниеТипаВыбора, "", "Таблица номенклатуры"));
	Таб = ЗначениеИзСтрокиВнутрСервер(ИсходнаяТаблица);
	Для Каждого Колонка Из Таб.Колонки Цикл
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения,"ТаблицаРаспределения"));
	КонецЦикла;
	ИзменитьРеквизиты(МассивРеквизитов);      
	ТаблицаПолейВыбора = Элементы.Добавить("ТаблицаРаспределения", Тип("ТаблицаФормы"));
	ТаблицаПолейВыбора.ПутьКДанным = "ТаблицаРаспределения";
	ТаблицаПолейВыбора.Отображение = ОтображениеТаблицы.Список;
	
	Для Каждого Колонка Из Таб.Колонки Цикл
		НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ТаблицаПолейВыбора);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "ТаблицаРаспределения." + Колонка.Имя;
		НовыйЭлемент.ДоступныеТипы = Колонка.ТипЗначения;	    
	КонецЦикла;

	ЗначениеВРеквизитФормы(Таб, "ТаблицаРаспределения");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(СсылкаНаДокумент)  = Ложь Тогда
		Элементы.ВыйтиИПометитьНаУдаление.Доступность = Ложь;
		Элементы.Записать.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеИзСтрокиВнутрСервер(Строка)
	Если Строка="" тогда возврат "" Конецесли;
	Возврат ЗначениеИзСтрокиВнутр(Строка);
КонецФункции


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ВыйтиИПометитьНаУдаление(Команда)
	ВыйтиИПометитьНаУдалениеСервер();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВыйтиИПометитьНаУдалениеСервер()
	Попытка
		ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления=Истина;
		ДокументОбъект.Записать();
	Исключение
		Сообщить("Не удалось записать документ." + СсылкаНаДокумент);
	КонецПопытки;
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьНаСервере()
	Таб = РеквизитФормыВЗначение("ТаблицаРаспределения");
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	ДокументОбъект[ИмяТаблицы].Очистить();
	Для каждого Стр Из Таб Цикл 
		СтрокаТоваров 	= ДокументОбъект[ИмяТаблицы].Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТоваров,Стр);
	КонецЦикла;
	Попытка
		ДокументОбъект.Записать();
	Исключение
		Сообщить("Не удалось записать документ." + СсылкаНаДокумент); 
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура Выйти(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

