
&НаКлиенте
Перем ЭДИ_ОбщиеИнструменты;
&НаКлиенте
Перем ЭДИ_РаботаСБазойДанных;
&НаКлиенте
Перем ПолучательБД_Подключен;

&НаКлиенте
Процедура ДобавитьЗапись(Команда)
	ФормаДобавления = ПолучитьФорму("ВнешняяОбработка.EDISOFT.Форма.ДобавлениеНоменклатуры");
	ФормаДобавления.ОткрытьМОдально();
	ОбновитьТаблицу();
КонецПроцедуры

Функция ПолучитьЗначениеИзСтроки(СтрОбъект)
	Возврат ЗначениеИзСтрокиВнутр(СтрОбъект);
КонецФункции
&НаКлиенте
Процедура ОбновитьТаблицу()
	
	Отбор = ЭДИ_РаботаСБазойДанных.ПолучитьПустуюЗапись();
	Отбор.Тип = "GOODSCODE";
	Запрос = ЭДИ_РаботаСБазойДанных.ПолучитьСписокСвойств(Отбор);	
	Если Запрос.Результат=0 тогда
		//Сообщить(Запрос.Сообщение);
	Иначе
		СписокДанных = Запрос.Содержимое;
		ТаблицаКодовНоменклатуры.Очистить();
		Для Сч=0 По СписокДанных.Верхнийиндекс() Цикл
			Свойство = СписокДанных.Получить(Сч);
			Номенклатура = ПолучитьЗначениеИзСтроки(Свойство.Объект); 
			Если ЗначениеЗаполнено(НоменклатураФильтр) Тогда
				Если НоменклатураФильтр<>Номенклатура Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Попытка 
				Контрагент = ПолучитьЗначениеИзСтроки(Свойство.Владелец);
			Исключение
				Контрагент = ПолучитьПустуюСсылкуНаКонтрагента();
			КонецПопытки;
			Если ЗначениеЗаполнено(КонтрагентФильтр) Тогда
				Если КонтрагентФильтр<>Контрагент Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока = ТаблицаКодовНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура = Номенклатура;			
			НоваяСтрока.Контрагент = Контрагент;
			НоваяСТрока.КодПокупателя = Свойство.ИндексированныйАтрибут1;
			НоваяСТрока.КодПоставщика = Свойство.ИндексированныйАтрибут2;
			НоваяСТрока.Штрихкод = Свойство.ИндексированныйАтрибут3;
		КонецЦикла; 		
	КонецЕслИ; 	
КонецПроцедуры

Функция ПолучитьПустуюСсылкуНаКонтрагента()
	Возврат Справочники.Контрагенты.ПустаяСсылка();
КонецФункции
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьНастройкиПодключения();
	ПолучитьОбщиеИнструменты();
	ОбновитьТаблицу();
КонецПроцедуры

Процедура ВосстановитьНастройкиПодключения()
	Объект.ЭДИ_ИмяТаблицы = ХранилищеОбщихНастроек.Загрузить("ОбъектЭДИ_ИмяТаблицы", "КлючЭДИ_ИмяТаблицы", "ЭДИ_ИмяТаблицы");
	Объект.ЭДИ_КаталогВнешнейБазыДанных = ХранилищеОбщихНастроек.Загрузить("ОбъектЭДИ_КаталогВнешнейБазыДанных", "КлючЭДИ_КаталогВнешнейБазыДанных", "ЭДИ_КаталогВнешнейБазыДанных");
	Объект.ЭДИ_ПарольБД = ХранилищеОбщихНастроек.Загрузить("ОбъектЭДИ_ПарольБД", "КлючЭДИ_ПарольБД", "ЭДИ_ПарольБД");
	Объект.ЭДИ_ПользовательБД = ХранилищеОбщихНастроек.Загрузить("ОбъектЭДИ_ПользовательБД", "КлючЭДИ_ПользовательБД", "ЭДИ_ПользовательБД");
	Объект.ЭДИ_ПортБД = ХранилищеОбщихНастроек.Загрузить("ОбъектЭДИ_ПортБД", "КлючЭДИ_ПортБД",  "ЭДИ_ПортБД");
	Объект.ЭДИ_РежимРаботыБД = ХранилищеОбщихНастроек.Загрузить("ОбъектЭДИ_РежимРаботыБД", "КлючЭДИ_РежимРаботыБД",  "ЭДИ_РежимРаботыБД");
	Объект.ЭДИ_СерверБД = ХранилищеОбщихНастроек.Загрузить("ОбъектЭДИ_СерверБД", "КлючЭДИ_СерверБД",  "ЭДИ_СерверБД");	
КонецПроцедуры
&НаКлиенте
Процедура ПолучитьОбщиеИнструменты()
	ЭДИ_ОбщиеИнструменты = Новый COMОбъект("EsTools1C.ExtTools");
	ПодключитьсяКБДПриОткрытии();
КонецПроцедуры
&НаКлиенте
Процедура ПодключитьсяКБДПриОткрытии()
	ПолучательБД_Подключен=ложь;   
	ЭДИ_ПараметрSQLITE=0;
	
	Если Объект.ЭДИ_РежимРаботыБД = "sqlite" тогда 
		ЭДИ_ПараметрSQLITE = 0;
		ЭДИ_СтрокаПодключения = СокрЛП(Объект.ЭДИ_КаталогВнешнейБазыДанных);
	ИначеЕсли Объект.ЭДИ_РежимРаботыБД = "MY" тогда 
		ЭДИ_СтрокаПодключения = "DRIVER={MySQL ODBC 5.3 ANSI Driver};Server="+СокрЛП(Объект.ЭДИ_СерверБД)+";Port="+СокрЛП(Объект.ЭДИ_ПортБД)+";Database="+СокрЛП(Объект.ЭДИ_КаталогВнешнейБазыДанных)+";User="+СокрЛП(Объект.ЭДИ_ПользовательБД)+";Password="+СокрЛП(Объект.ЭДИ_ПарольБД)+";";  //MySQL
	ИначеЕсли Объект.ЭДИ_РежимРаботыБД = "PG" тогда  
		ЭДИ_СтрокаПодключения = "DSN=PostgreSQL30;Server="+СокрЛП(Объект.ЭДИ_СерверБД)+";Port="+СокрЛП(Объект.ЭДИ_ПортБД)+";Database="+СокрЛП(Объект.ЭДИ_КаталогВнешнейБазыДанных)+";UID="+СокрЛП(Объект.ЭДИ_ПользовательБД)+";Pwd="+СокрЛП(Объект.ЭДИ_ПарольБД)+";";   //PostgreSQL
	иначеЕсли Объект.ЭДИ_РежимРаботыБД = "MSNC10" тогда  
		ЭДИ_СтрокаПодключения = "Driver={SQL Server Native Client 10.0};Server="+СокрЛП(Объект.ЭДИ_СерверБД)+";Database="+СокрЛП(Объект.ЭДИ_КаталогВнешнейБазыДанных)+";Uid="+СокрЛП(Объект.ЭДИ_ПользовательБД)+";Pwd="+СокрЛП(Объект.ЭДИ_ПарольБД)+";"
	иначеЕсли Объект.ЭДИ_РежимРаботыБД = "MSNC11" тогда  
		ЭДИ_СтрокаПодключения = "Driver={SQL Server Native Client 11.0};Server="+СокрЛП(Объект.ЭДИ_СерверБД)+";Database="+СокрЛП(Объект.ЭДИ_КаталогВнешнейБазыДанных)+";Uid="+СокрЛП(Объект.ЭДИ_ПользовательБД)+";Pwd="+СокрЛП(Объект.ЭДИ_ПарольБД)+";"
	иначеЕсли Объект.ЭДИ_РежимРаботыБД = "MSSSD" тогда  
		ЭДИ_СтрокаПодключения = "Driver={SQL Server};Server="+СокрЛП(Объект.ЭДИ_СерверБД)+";Database="+СокрЛП(Объект.ЭДИ_КаталогВнешнейБазыДанных)+";Uid="+СокрЛП(Объект.ЭДИ_ПользовательБД)+";Pwd="+СокрЛП(Объект.ЭДИ_ПарольБД)+";"
	КонецЕСлИ; 
	
	Если ЭДИ_СтрокаПодключения="" тогда
		Предупреждение("Нет настроек подключения к БД!");
		Возврат;
	КонецеСли;

	ИмяТаблицыПолучатель = СокрЛП(Объект.ЭДИ_ИмяТаблицы);
	
	Попытка
		ЭДИ_РаботаСБазойДанных = ЭДИ_ОбщиеИнструменты.ПолучитьВнешнююБазуДанных(ЭДИ_СтрокаПодключения, Объект.ЭДИ_РежимРаботыБД, ЭДИ_ПараметрSQLITE, ИмяТаблицыПолучатель);
		Если ЭДИ_РаботаСБазойДанных.ЕстьОшибка=1 тогда
			ПолучательБД_Подключен = Ложь;
			Сообщить("Ошибка подключение к базе данных по причине: " + ЭДИ_РаботаСБазойДанных.СообщениеОшибки + ". Проверьте параметры подключения на странице настройки.");
			//Элементы.ПодключитьсяКБД.ЦветФона = WebЦвета.Коралловый;
		иначе	
			ПолучательБД_Подключен = Истина;
			//Элементы.ПодключитьсяКБД.ЦветФона = WebЦвета.ЗеленоЖелтый;
		КонецЕСЛИ;					
	исключение
		ПолучательБД_Подключен = Ложь;
		Сообщить(Описаниеошибки());
	Конецпопытки;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураФильтрПриИзменении(Элемент)
	ОбновитьТаблицу();
КонецПроцедуры
&НаКлиенте
Процедура КонтрагентФильтрПриИзменении(Элемент)
	ОбновитьТаблицу();
КонецПроцедуры
&НаКлиенте
Процедура УдалитьЗапись(Команда)
	
	КоличествоВыделенныхСтрок = ЭтаФорма.Элементы.ТаблицаКодовНоменклатуры.ВыделенныеСтроки.Количество();
	Сч = 0;
	Если КоличествоВыделенныхСтрок>0 Тогда
		Для Сч = 0 По КоличествоВыделенныхСтрок-1 Цикл
			НомерТекущейСтроки = ЭтаФорма.Элементы.ТаблицаКодовНоменклатуры.ВыделенныеСтроки.Получить(Сч);
			ТекущаяСтрока = ТаблицаКодовНоменклатуры.Получить(НомерТекущейСтроки);
			Номенклатура = ТекущаяСТрока.Номенклатура;
			Контрагент = ТекущаяСтрока.Контрагент;
			УдалитьСтроку(Номенклатура, Контрагент);
		КонецЦикла;	
	КонецЕсли;
	ОбновитьТаблицу();
КонецПроцедуры
Функция ЗначениеВСтрокуВнутрСервер(ОбъектСвойства)
	Возврат ЗначениеВСтрокуВнутр(ОбъектСвойства);
КонецФункции
&НаКлиенте
Процедура УдалитьСтроку(Номенклатура, Контрагент)
	Отбор = ЭДИ_РаботаСБазойДанных.ПолучитьПустуюЗапись();
	Отбор.Тип = "GOODSCODE";
	Отбор.Объект = ЗначениеВСтрокуВнутрСервер(Номенклатура);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Отбор.Владелец = СокрЛП(ЗначениеВСтрокуВнутрСервер(КОнтрагент));
	КонецЕсли;
	Запрос = ЭДИ_РаботаСБазойДанных.ПолучитьСвойство(Отбор);	
	Если Запрос.Результат=0 тогда
		Сообщить("В БД Не найдена запись для номенклатуры " + Номенклатура);
	Иначе
		Свойство = Запрос.Содержимое;
		Результат = ЭДИ_РаботаСБазойДанных.УдалитьСвойство(Свойство.Индекс);
		Если Результат.Результат = 0 Тогда
			Сообщить("Не удалось удалить запись по причине: " + Результат.Сообщение);
		КонецЕсли;
	КонецЕслИ; 		
КонецПроцедуры